app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]