app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-03-21 22:27:53.863594"], ["updated_at", "2018-03-21 22:27:53.863594"]]
---
  def create
    student = Student.create(params.require(:student).permit(:first_name, :last_name))